# Working with Dates and Times

### 1. Intro to the Working with Dates and Times Module

In [1]:
import pandas as pd
import datetime as dt

### 2. Review of Python's datetime Module

In [2]:
someday = dt.date(2016, 4, 12)

In [3]:
someday.year

2016

In [4]:
someday.month

4

In [5]:
someday.day

12

In [6]:
dt.datetime(2010, 1, 10, 13, 57)

datetime.datetime(2010, 1, 10, 13, 57)

In [7]:
str(dt.datetime(2010, 1, 10, 13, 57))

'2010-01-10 13:57:00'

### 3. The pandas Timestamp Object

In [8]:
pd.Timestamp("2015-03-31")

Timestamp('2015-03-31 00:00:00')

In [9]:
pd.Timestamp("2015/03/31")

Timestamp('2015-03-31 00:00:00')

In [10]:
pd.Timestamp("2015, 03, 31")

Timestamp('2015-03-31 00:00:00')

In [11]:
pd.Timestamp("1/1/2015")

Timestamp('2015-01-01 00:00:00')

In [12]:
pd.Timestamp("19/12/2015")

Timestamp('2015-12-19 00:00:00')

In [13]:
pd.Timestamp("12/19/2015")

Timestamp('2015-12-19 00:00:00')

In [14]:
pd.Timestamp("4/3/2015")

Timestamp('2015-04-03 00:00:00')

In [15]:
pd.Timestamp("2021-03-08 08:35:15")

Timestamp('2021-03-08 08:35:15')

In [16]:
pd.Timestamp("2021-03-08 6:13:29 PM")

Timestamp('2021-03-08 18:13:29')

In [17]:
pd.Timestamp("2015, 1, 1")

Timestamp('2015-01-01 00:00:00')

In [18]:
pd.Timestamp(dt.datetime(2000, 2, 3, 21, 34))

Timestamp('2000-02-03 21:34:00')

### 4. The pandas DateTimeIndex Object

In [19]:
dates = ["2016-01-02", "2016-04-12", "2009-09-07"]
pd.DatetimeIndex(dates)

DatetimeIndex(['2016-01-02', '2016-04-12', '2009-09-07'], dtype='datetime64[ns]', freq=None)

In [20]:
dates = [dt.date(2016, 1, 10), dt.date(1994, 6, 13), dt.date(2003, 12, 19)]
dtIndex = pd.DatetimeIndex(dates)

In [21]:
values = [100, 200, 300]

In [22]:
pd.Series(data = values, index = dtIndex)

2016-01-10    100
1994-06-13    200
2003-12-19    300
dtype: int64

### 5. The pd.to_datetime() Method

In [23]:
 pd.to_datetime("2001-04-09")

Timestamp('2001-04-09 00:00:00')

In [24]:
 pd.to_datetime(dt.date(2015, 1, 1))

Timestamp('2015-01-01 00:00:00')

In [25]:
pd.to_datetime(dt.datetime(2015, 1, 1, 14, 35, 20))

Timestamp('2015-01-01 14:35:20')

In [26]:
pd.to_datetime(["2015-01-03", "2014/02/08", "2016", "July 4th 1996"])

DatetimeIndex(['2015-01-03', '2014-02-08', '2016-01-01', '1996-07-04'], dtype='datetime64[ns]', freq=None)

In [27]:
times = pd.Series(["2015-01-03", "2014/02/08", "2016", "July 4th 1996"])

In [28]:
times

0       2015-01-03
1       2014/02/08
2             2016
3    July 4th 1996
dtype: object

In [29]:
pd.to_datetime(times)

0   2015-01-03
1   2014-02-08
2   2016-01-01
3   1996-07-04
dtype: datetime64[ns]

In [30]:
dates = pd.Series(["July 4th 1996", "10/04/1991", "Hello", "2015-02-31"])
dates

0    July 4th 1996
1       10/04/1991
2            Hello
3       2015-02-31
dtype: object

In [31]:
pd.to_datetime(dates, errors="coerce")

0   1996-07-04
1   1991-10-04
2          NaT
3          NaT
dtype: datetime64[ns]

### 6. Create Range of Dates with the pd.date_range() Method, Part 1

<b>NOTE:</b> We can use different freq parameters like B - business days (no weekends), W - week (sunday by default), H - hour and for example 6H - six hours, M - month end(by default), MS - month start, A - year end

In [33]:
times = pd.date_range(start = "2016-01-01", end = "2016-01-10", freq = "W")

In [34]:
type(times)

pandas.core.indexes.datetimes.DatetimeIndex

In [37]:
type(times[0])

pandas._libs.tslib.Timestamp

### 7. Create Range of Dates with the pd.date_range() Method, Part 2

In [39]:
pd.date_range(start = "2012-09-09", periods = 25, freq = "B")

DatetimeIndex(['2012-09-10', '2012-09-11', '2012-09-12', '2012-09-13',
               '2012-09-14', '2012-09-17', '2012-09-18', '2012-09-19',
               '2012-09-20', '2012-09-21', '2012-09-24', '2012-09-25',
               '2012-09-26', '2012-09-27', '2012-09-28', '2012-10-01',
               '2012-10-02', '2012-10-03', '2012-10-04', '2012-10-05',
               '2012-10-08', '2012-10-09', '2012-10-10', '2012-10-11',
               '2012-10-12'],
              dtype='datetime64[ns]', freq='B')

### 8. Create Range of Dates with the pd.date_range() Method, Part 3

In [42]:
pd.date_range(end = "1999-12-31", periods=40, freq="W-SUN")

DatetimeIndex(['1999-03-28', '1999-04-04', '1999-04-11', '1999-04-18',
               '1999-04-25', '1999-05-02', '1999-05-09', '1999-05-16',
               '1999-05-23', '1999-05-30', '1999-06-06', '1999-06-13',
               '1999-06-20', '1999-06-27', '1999-07-04', '1999-07-11',
               '1999-07-18', '1999-07-25', '1999-08-01', '1999-08-08',
               '1999-08-15', '1999-08-22', '1999-08-29', '1999-09-05',
               '1999-09-12', '1999-09-19', '1999-09-26', '1999-10-03',
               '1999-10-10', '1999-10-17', '1999-10-24', '1999-10-31',
               '1999-11-07', '1999-11-14', '1999-11-21', '1999-11-28',
               '1999-12-05', '1999-12-12', '1999-12-19', '1999-12-26'],
              dtype='datetime64[ns]', freq='W-SUN')

In [43]:
pd.date_range(end = "1999-12-31", periods=40, freq="M")

DatetimeIndex(['1996-09-30', '1996-10-31', '1996-11-30', '1996-12-31',
               '1997-01-31', '1997-02-28', '1997-03-31', '1997-04-30',
               '1997-05-31', '1997-06-30', '1997-07-31', '1997-08-31',
               '1997-09-30', '1997-10-31', '1997-11-30', '1997-12-31',
               '1998-01-31', '1998-02-28', '1998-03-31', '1998-04-30',
               '1998-05-31', '1998-06-30', '1998-07-31', '1998-08-31',
               '1998-09-30', '1998-10-31', '1998-11-30', '1998-12-31',
               '1999-01-31', '1999-02-28', '1999-03-31', '1999-04-30',
               '1999-05-31', '1999-06-30', '1999-07-31', '1999-08-31',
               '1999-09-30', '1999-10-31', '1999-11-30', '1999-12-31'],
              dtype='datetime64[ns]', freq='M')

In [44]:
pd.date_range(end = "1999-12-31", periods=40, freq="MS")

DatetimeIndex(['1996-09-01', '1996-10-01', '1996-11-01', '1996-12-01',
               '1997-01-01', '1997-02-01', '1997-03-01', '1997-04-01',
               '1997-05-01', '1997-06-01', '1997-07-01', '1997-08-01',
               '1997-09-01', '1997-10-01', '1997-11-01', '1997-12-01',
               '1998-01-01', '1998-02-01', '1998-03-01', '1998-04-01',
               '1998-05-01', '1998-06-01', '1998-07-01', '1998-08-01',
               '1998-09-01', '1998-10-01', '1998-11-01', '1998-12-01',
               '1999-01-01', '1999-02-01', '1999-03-01', '1999-04-01',
               '1999-05-01', '1999-06-01', '1999-07-01', '1999-08-01',
               '1999-09-01', '1999-10-01', '1999-11-01', '1999-12-01'],
              dtype='datetime64[ns]', freq='MS')

### 9. The .dt Accessor

In [46]:
bunch_of_dates = pd.date_range(start = "2000-01-01", end = "2010-12-31", freq = "24D")

In [47]:
s = pd.Series(bunch_of_dates)
s.head(3)

0   2000-01-01
1   2000-01-25
2   2000-02-18
dtype: datetime64[ns]

In [52]:
# number of the month from calendar
s.dt.month

0       1
1       1
2       2
3       3
4       4
5       4
6       5
7       6
8       7
9       8
10      8
11      9
12     10
13     11
14     12
15     12
16      1
17      2
18      3
19      4
20      4
21      5
22      6
23      7
24      7
25      8
26      9
27     10
28     11
29     11
       ..
138     1
139     2
140     3
141     4
142     5
143     5
144     6
145     7
146     8
147     8
148     9
149    10
150    11
151    12
152    12
153     1
154     2
155     3
156     4
157     4
158     5
159     6
160     7
161     7
162     8
163     9
164    10
165    11
166    11
167    12
Length: 168, dtype: int64

In [53]:
# number of the day from calendar
s.dt.day

0       1
1      25
2      18
3      13
4       6
5      30
6      24
7      17
8      11
9       4
10     28
11     21
12     15
13      8
14      2
15     26
16     19
17     12
18      8
19      1
20     25
21     19
22     12
23      6
24     30
25     23
26     16
27     10
28      3
29     27
       ..
138    25
139    18
140    14
141     7
142     1
143    25
144    18
145    12
146     5
147    29
148    22
149    16
150     9
151     3
152    27
153    20
154    13
155     9
156     2
157    26
158    20
159    13
160     7
161    31
162    24
163    17
164    11
165     4
166    28
167    22
Length: 168, dtype: int64

In [54]:
# name of week day from calendar
s.dt.weekday_name

0       Saturday
1        Tuesday
2         Friday
3         Monday
4       Thursday
5         Sunday
6      Wednesday
7       Saturday
8        Tuesday
9         Friday
10        Monday
11      Thursday
12        Sunday
13     Wednesday
14      Saturday
15       Tuesday
16        Friday
17        Monday
18      Thursday
19        Sunday
20     Wednesday
21      Saturday
22       Tuesday
23        Friday
24        Monday
25      Thursday
26        Sunday
27     Wednesday
28      Saturday
29       Tuesday
         ...
138       Sunday
139    Wednesday
140     Saturday
141      Tuesday
142       Friday
143       Monday
144     Thursday
145       Sunday
146    Wednesday
147     Saturday
148      Tuesday
149       Friday
150       Monday
151     Thursday
152       Sunday
153    Wednesday
154     Saturday
155      Tuesday
156       Friday
157       Monday
158     Thursday
159       Sunday
160    Wednesday
161     Saturday
162      Tuesday
163       Friday
164       Monday
165     Thursday
166       Sunday
167    Wednesday
Length: 168, dtype: object

In [56]:
# bool value representing the answer to whether a given day is at the beginning of a quarter?
s.dt.is_quarter_start

0       True
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19      True
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
138    False
139    False
140    False
141    False
142    False
143    False
144    False
145    False
146    False
147    False
148    False
149    False
150    False
151    False
152    False
153    False
154    False
155    False
156    False
157    False
158    False
159    False
160    False
161    False
162    False
163    False
164    False
165    False
166    False
167    False
Length: 168, dtype: bool

In [58]:
# filtration to find days at the beginning of a quarter
mask = s.dt.is_quarter_start
s[mask]

0     2000-01-01
19    2001-04-01
38    2002-07-01
137   2009-01-01
dtype: datetime64[ns]

### 11. Import Financial Data Set with pandas_datareader Library

In [1]:
import pandas as pd
import datetime as dt
from pandas_datareader import data

In [63]:
company = 'MSFT' # Microsoft
start = "2010-01-01"
end = "2017-12-31"

stocks = data.DataReader(name=company, data_source="google", start=start, end=end)
stocks.head(3)

             Open   High    Low  Close    Volume
Date
2016-10-24  59.94  61.00  59.93  61.00  54066978
2016-10-25  60.85  61.37  60.80  60.99  35137164
2016-10-26  60.81  61.20  60.47  60.63  29911608

In [64]:
stocks.values

array([[  5.99400000e+01,   6.10000000e+01,   5.99300000e+01,
          6.10000000e+01,   5.40669780e+07],
       [  6.08500000e+01,   6.13700000e+01,   6.08000000e+01,
          6.09900000e+01,   3.51371640e+07],
       [  6.08100000e+01,   6.12000000e+01,   6.04700000e+01,
          6.06300000e+01,   2.99116080e+07],
       ...,
       [  7.76700000e+01,   7.78500000e+01,   7.73700000e+01,
          7.76100000e+01,   1.33007010e+07],
       [  7.75700000e+01,   7.79300000e+01,   7.73500000e+01,
          7.79100000e+01,   1.50927580e+07],
       [  7.83200000e+01,   7.89700000e+01,   7.82200000e+01,
          7.88100000e+01,   2.28664260e+07]])

In [66]:
stocks.columns

Index(['Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')

In [69]:
stocks.index[0]

Timestamp('2016-10-24 00:00:00')

In [70]:
stocks.axes

[DatetimeIndex(['2016-10-24', '2016-10-25', '2016-10-26', '2016-10-27',
                '2016-10-28', '2016-10-31', '2016-11-01', '2016-11-02',
                '2016-11-03', '2016-11-04',
                ...
                '2017-10-09', '2017-10-10', '2017-10-11', '2017-10-12',
                '2017-10-13', '2017-10-16', '2017-10-17', '2017-10-18',
                '2017-10-19', '2017-10-20'],
               dtype='datetime64[ns]', name='Date', length=251, freq=None),
 Index(['Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')]

### 12. Selecting Rows from a DataFrame with a DateTimeIndex

In [72]:
stocks.loc["2016-10-24"]

Open            59.94
High            61.00
Low             59.93
Close           61.00
Volume    54066978.00
Name: 2016-10-24 00:00:00, dtype: float64

In [81]:
stocks.iloc[250]

Open            78.32
High            78.97
Low             78.22
Close           78.81
Volume    22866426.00
Name: 2017-10-20 00:00:00, dtype: float64

In [82]:
stocks.loc["2017-10-01" : "2017-10-07"]

             Open   High    Low  Close    Volume
Date
2017-10-02  74.71  75.01  74.30  74.61  15304762
2017-10-03  74.67  74.88  74.20  74.26  12190403
2017-10-04  74.09  74.72  73.71  74.69  13317681
2017-10-05  75.22  76.12  74.96  75.97  21195261
2017-10-06  75.67  76.03  75.54  76.00  13959814

In [87]:
days = pd.date_range(start="2017-01-01", end="2017-10-23", freq="W-MON")

In [90]:
mask = stocks.index.isin(days)
stocks[mask]

             Open   High    Low  Close    Volume
Date
2017-01-09  62.76  63.08  62.54  62.64  20382730
2017-01-23  62.70  63.12  62.57  62.96  23097581
2017-01-30  65.69  65.79  64.80  65.13  31651445
2017-02-06  63.50  63.65  63.14  63.64  19796360
2017-02-13  64.24  64.86  64.13  64.72  22920101
2017-02-27  64.54  64.54  64.04  64.23  15871507
2017-03-06  63.97  64.56  63.81  64.27  18750255
2017-03-13  65.01  65.20  64.57  64.71  20100035
2017-03-20  64.91  65.18  64.72  64.93  14598083
2017-03-27  64.63  65.22  64.35  65.10  18614662
2017-04-03  65.81  65.94  65.19  65.55  20400871
2017-04-10  65.61  65.82  65.36  65.53  17952742
2017-04-17  65.04  65.49  65.01  65.48  16689265
2017-04-24  67.48  67.66  67.10  67.53  29769976
2017-05-01  68.68  69.55  68.50  69.41  31954362
2017-05-08  68.97  69.05  68.42  68.94  18566087
2017-05-15  68.14  68.48  67.57  68.43  31530301
2017-05-22  67.89  68.50  67.50  68.45  16237550
2017-06-05  71.97  72.89  71.81  72.28  33316760
2017-06-12  69.25  69.94  68.13  69.78  47761743
2017-06-19  70.50  70.94  70.35  70.87  23798268
2017-06-26  71.40  71.71  70.44  70.53  19606974
2017-07-03  69.33  69.60  68.02  68.17  16165538
2017-07-10  69.46  70.25  69.20  69.98  15014503
2017-07-17  72.80  73.45  72.72  73.35  21803907
2017-07-24  73.53  73.75  73.13  73.60  21394826
2017-07-31  73.30  73.44  72.41  72.70  23600054
2017-08-07  72.80  72.90  72.26  72.40  18705681
2017-08-14  73.06  73.72  72.95  73.59  20096592
2017-08-21  72.47  72.48  71.70  72.15  17734767
2017-08-28  73.06  73.09  72.55  72.83  14569715
2017-09-11  74.31  74.94  74.31  74.76  17910383
2017-09-18  75.23  75.97  75.04  75.16  23306959
2017-09-25  74.09  74.25  72.92  73.26  24149163
2017-10-02  74.71  75.01  74.30  74.61  15304762
2017-10-09  75.97  76.55  75.86  76.29  11386502
2017-10-16  77.42  77.81  77.35  77.65  12380093

### 13. Timestamp Object Attributes

In [92]:
someday = stocks.index[200]
someday

Timestamp('2017-08-10 00:00:00')

In [93]:
someday.day

10

In [94]:
someday.month

8

In [95]:
someday.weekday_name

'Thursday'

In [96]:
stocks.insert(0, "Day of Week", stocks.index.weekday_name)

In [97]:
stocks.head(5)

           Day of Week   Open   High    Low  Close    Volume
Date
2016-10-24      Monday  59.94  61.00  59.93  61.00  54066978
2016-10-25     Tuesday  60.85  61.37  60.80  60.99  35137164
2016-10-26   Wednesday  60.81  61.20  60.47  60.63  29911608
2016-10-27    Thursday  60.61  60.83  60.09  60.10  28479856
2016-10-28      Friday  60.01  60.52  59.58  59.87  33574684

In [98]:
stocks.insert(1, "Is Start of Month", stocks.index.is_month_start)

In [99]:
stocks.head(5)

,Day of Week,Is Start of Month,Open,High,Low,Close,Volume
Date,,,,,,,
2016-10-24,Monday,False,59.94,61.00,59.93,61.00,54066978
2016-10-25,Tuesday,False,60.85,61.37,60.80,60.99,35137164
2016-10-26,Wednesday,False,60.81,61.20,60.47,60.63,29911608
2016-10-27,Thursday,False,60.61,60.83,60.09,60.10,28479856
2016-10-28,Friday,False,60.01,60.52,59.58,59.87,33574684

In [100]:
stocks[stocks["Is Start of Month"]]

,Day of Week,Is Start of Month,Open,High,Low,Close,Volume
Date,,,,,,,
2016-11-01,Tuesday,True,59.97,60.02,59.25,59.80,24532986
2016-12-01,Thursday,True,60.11,60.15,58.94,59.20,34542121
2017-02-01,Wednesday,True,64.36,64.62,63.47,63.58,39671528
2017-03-01,Wednesday,True,64.13,64.99,64.02,64.94,26937459
2017-05-01,Monday,True,68.68,69.55,68.50,69.41,31954362
2017-06-01,Thursday,True,70.24,70.61,69.45,70.10,21603601
2017-08-01,Tuesday,True,73.10,73.42,72.49,72.58,20823890
2017-09-01,Friday,True,74.71,74.74,73.64,73.94,21736161

### 14. The .truncate() Method

In [101]:
company = 'MSFT' # Microsoft
start = "2010-01-01"
end = "2017-12-31"

stocks = data.DataReader(name=company, data_source="google", start=start, end=end)
stocks.head(3)

             Open   High    Low  Close    Volume
Date
2016-10-24  59.94  61.00  59.93  61.00  54066978
2016-10-25  60.85  61.37  60.80  60.99  35137164
2016-10-26  60.81  61.20  60.47  60.63  29911608

In [102]:
stocks.truncate(before="2017-02-05", after="2017-02-28")

             Open   High    Low  Close    Volume
Date
2017-02-06  63.50  63.65  63.14  63.64  19796360
2017-02-07  63.74  63.78  63.23  63.43  20277226
2017-02-08  63.57  63.81  63.22  63.34  18096358
2017-02-09  63.52  64.44  63.32  64.06  22644443
2017-02-10  64.25  64.30  63.98  64.00  18170729
2017-02-13  64.24  64.86  64.13  64.72  22920101
2017-02-14  64.41  64.72  64.02  64.57  23108426
2017-02-15  64.50  64.57  64.16  64.53  17005157
2017-02-16  64.74  65.24  64.44  64.52  20546345
2017-02-17  64.47  64.69  64.30  64.62  21248818
2017-02-21  64.61  64.95  64.45  64.49  20655869
2017-02-22  64.33  64.39  64.05  64.36  19292651
2017-02-23  64.42  64.73  64.20  64.62  20273128
2017-02-24  64.53  64.80  64.14  64.62  21796800
2017-02-27  64.54  64.54  64.04  64.23  15871507
2017-02-28  64.08  64.20  63.76  63.98  23239825

### 15. pd.DateOffset Objects

In [105]:
stocks = data.DataReader(name = "GOOG", data_source="google", 
                start = dt.date(2000, 1, 1), end = dt.datetime.now())
stocks.head(3)

              Open    High     Low   Close   Volume
Date
2016-10-24  804.90  815.18  804.82  813.11  1697514
2016-10-25  816.68  816.68  805.14  807.67  1576404
2016-10-26  806.34  806.98  796.32  799.07  1647733

In [107]:
stocks.index + pd.DateOffset(days = 5)

DatetimeIndex(['2016-10-29', '2016-10-30', '2016-10-31', '2016-11-01',
               '2016-11-02', '2016-11-05', '2016-11-06', '2016-11-07',
               '2016-11-08', '2016-11-09',
               ...
               '2017-10-14', '2017-10-15', '2017-10-16', '2017-10-17',
               '2017-10-18', '2017-10-21', '2017-10-22', '2017-10-23',
               '2017-10-24', '2017-10-25'],
              dtype='datetime64[ns]', name='Date', length=251, freq=None)

In [108]:
stocks.index + pd.DateOffset(weeks = 2)

DatetimeIndex(['2016-11-07', '2016-11-08', '2016-11-09', '2016-11-10',
               '2016-11-11', '2016-11-14', '2016-11-15', '2016-11-16',
               '2016-11-17', '2016-11-18',
               ...
               '2017-10-23', '2017-10-24', '2017-10-25', '2017-10-26',
               '2017-10-27', '2017-10-30', '2017-10-31', '2017-11-01',
               '2017-11-02', '2017-11-03'],
              dtype='datetime64[ns]', name='Date', length=251, freq=None)

In [109]:
stocks.index - pd.DateOffset(weeks = 2)

DatetimeIndex(['2016-10-10', '2016-10-11', '2016-10-12', '2016-10-13',
               '2016-10-14', '2016-10-17', '2016-10-18', '2016-10-19',
               '2016-10-20', '2016-10-21',
               ...
               '2017-09-25', '2017-09-26', '2017-09-27', '2017-09-28',
               '2017-09-29', '2017-10-02', '2017-10-03', '2017-10-04',
               '2017-10-05', '2017-10-06'],
              dtype='datetime64[ns]', name='Date', length=251, freq=None)

In [110]:
stocks.index - pd.DateOffset(hours = 3)

DatetimeIndex(['2016-10-23 21:00:00', '2016-10-24 21:00:00',
               '2016-10-25 21:00:00', '2016-10-26 21:00:00',
               '2016-10-27 21:00:00', '2016-10-30 21:00:00',
               '2016-10-31 21:00:00', '2016-11-01 21:00:00',
               '2016-11-02 21:00:00', '2016-11-03 21:00:00',
               ...
               '2017-10-08 21:00:00', '2017-10-09 21:00:00',
               '2017-10-10 21:00:00', '2017-10-11 21:00:00',
               '2017-10-12 21:00:00', '2017-10-15 21:00:00',
               '2017-10-16 21:00:00', '2017-10-17 21:00:00',
               '2017-10-18 21:00:00', '2017-10-19 21:00:00'],
              dtype='datetime64[ns]', name='Date', length=251, freq=None)

In [111]:
stocks.index - pd.DateOffset(years = 1, months = 3, days = 10)

DatetimeIndex(['2015-07-14', '2015-07-15', '2015-07-16', '2015-07-17',
               '2015-07-18', '2015-07-21', '2015-07-22', '2015-07-23',
               '2015-07-24', '2015-07-25',
               ...
               '2016-06-29', '2016-06-30', '2016-07-01', '2016-07-02',
               '2016-07-03', '2016-07-06', '2016-07-07', '2016-07-08',
               '2016-07-09', '2016-07-10'],
              dtype='datetime64[ns]', name='Date', length=251, freq=None)

### 16. More Fun with pd.DateOffset Objects

In [112]:
stocks.index + pd.tseries.offsets.MonthEnd()

DatetimeIndex(['2016-10-31', '2016-10-31', '2016-10-31', '2016-10-31',
               '2016-10-31', '2016-11-30', '2016-11-30', '2016-11-30',
               '2016-11-30', '2016-11-30',
               ...
               '2017-10-31', '2017-10-31', '2017-10-31', '2017-10-31',
               '2017-10-31', '2017-10-31', '2017-10-31', '2017-10-31',
               '2017-10-31', '2017-10-31'],
              dtype='datetime64[ns]', name='Date', length=251, freq=None)

In [113]:
import pandas as pd
import datetime as dt
from pandas_datareader import data
from pandas.tseries.offsets import *

In [114]:
stocks.index - MonthEnd()

DatetimeIndex(['2016-09-30', '2016-09-30', '2016-09-30', '2016-09-30',
               '2016-09-30', '2016-09-30', '2016-10-31', '2016-10-31',
               '2016-10-31', '2016-10-31',
               ...
               '2017-09-30', '2017-09-30', '2017-09-30', '2017-09-30',
               '2017-09-30', '2017-09-30', '2017-09-30', '2017-09-30',
               '2017-09-30', '2017-09-30'],
              dtype='datetime64[ns]', name='Date', length=251, freq=None)

In [115]:
stocks.index + BMonthEnd()

C:\Users\AFGHAN92\Anaconda3\lib\site-packages\pandas\core\indexes\datetimes.py:831: PerformanceWarning: Non-vectorized DateOffset being applied to Series or DatetimeIndex
  "or DatetimeIndex", PerformanceWarning)

DatetimeIndex(['2016-10-31', '2016-10-31', '2016-10-31', '2016-10-31',
               '2016-10-31', '2016-11-30', '2016-11-30', '2016-11-30',
               '2016-11-30', '2016-11-30',
               ...
               '2017-10-31', '2017-10-31', '2017-10-31', '2017-10-31',
               '2017-10-31', '2017-10-31', '2017-10-31', '2017-10-31',
               '2017-10-31', '2017-10-31'],
              dtype='datetime64[ns]', name='Date', length=251, freq=None)

In [116]:
stocks.index + QuarterEnd()

DatetimeIndex(['2016-12-31', '2016-12-31', '2016-12-31', '2016-12-31',
               '2016-12-31', '2016-12-31', '2016-12-31', '2016-12-31',
               '2016-12-31', '2016-12-31',
               ...
               '2017-12-31', '2017-12-31', '2017-12-31', '2017-12-31',
               '2017-12-31', '2017-12-31', '2017-12-31', '2017-12-31',
               '2017-12-31', '2017-12-31'],
              dtype='datetime64[ns]', name='Date', length=251, freq=None)

In [117]:
stocks.index + YearEnd()

DatetimeIndex(['2016-12-31', '2016-12-31', '2016-12-31', '2016-12-31',
               '2016-12-31', '2016-12-31', '2016-12-31', '2016-12-31',
               '2016-12-31', '2016-12-31',
               ...
               '2017-12-31', '2017-12-31', '2017-12-31', '2017-12-31',
               '2017-12-31', '2017-12-31', '2017-12-31', '2017-12-31',
               '2017-12-31', '2017-12-31'],
              dtype='datetime64[ns]', name='Date', length=251, freq=None)

### 17. The pandas Timedelta Object

In [6]:
timeA = pd.Timestamp("2016-03-31 04:35:16 PM")
timeB = pd.Timestamp("2016-03-20 02:16:49 AM")

In [11]:
# negative time
timeB - timeA

Timedelta('-12 days +09:41:33')

In [8]:
type(timeA - timeB)

pandas._libs.tslib.Timedelta

In [9]:
type(timeA)

pandas._libs.tslib.Timestamp

In [14]:
pd.Timedelta(days = 3, minutes = 45, hours = 12, weeks = 8)

Timedelta('59 days 12:45:00')

In [15]:
pd.Timedelta("5 minutes")

Timedelta('0 days 00:05:00')

In [17]:
pd.Timedelta("14 days 6 hours 12 minutes")

Timedelta('14 days 06:12:00')

### 18. Timedeltas in a Dataset

In [21]:
shipping = pd.read_csv("../00_Datasers/ecommerce.csv", index_col= "ID", parse_dates=["order_date", "delivery_date"])
shipping.head(3)

   order_date delivery_date
ID
1  1998-05-24    1999-02-05
2  1992-04-22    1998-03-06
4  1991-02-10    1992-08-26

In [24]:
shipping["Delivery Time"] = shipping["delivery_date"] - shipping["order_date"]
shipping.head(3)

   order_date delivery_date Delivery Time
ID
1  1998-05-24    1999-02-05      257 days
2  1992-04-22    1998-03-06     2144 days
4  1991-02-10    1992-08-26      563 days

In [27]:
shipping["Twice As Long"] = shipping["delivery_date"] + shipping["Delivery Time"]
shipping.head(3)

   order_date delivery_date Delivery Time Twice As Long
ID
1  1998-05-24    1999-02-05      257 days    1999-10-20
2  1992-04-22    1998-03-06     2144 days    2004-01-18
4  1991-02-10    1992-08-26      563 days    1994-03-12

In [28]:
shipping.dtypes

order_date        datetime64[ns]
delivery_date     datetime64[ns]
Delivery Time    timedelta64[ns]
Twice As Long     datetime64[ns]
dtype: object

In [31]:
mask = shipping["Delivery Time"] > "365 days"
shipping[mask]

    order_date delivery_date Delivery Time Twice As Long
ID
2   1992-04-22    1998-03-06     2144 days    2004-01-18
4   1991-02-10    1992-08-26      563 days    1994-03-12
5   1992-07-21    1997-11-20     1948 days    2003-03-22
7   1993-09-02    1998-06-10     1742 days    2003-03-18
9   1990-01-25    1994-10-02     1711 days    1999-06-09
10  1992-02-23    1998-12-30     2502 days    2005-11-05
11  1996-07-12    1997-07-14      367 days    1998-07-16
18  1995-06-18    1997-10-13      848 days    2000-02-08
20  1992-10-17    1998-10-06     2180 days    2004-09-24
23  1992-05-30    1999-08-15     2633 days    2006-10-30
26  1996-04-11    1998-05-04      753 days    2000-05-26
32  1990-01-20    1998-07-24     3107 days    2007-01-25
33  1994-09-21    1996-10-12      752 days    1998-11-03
35  1993-09-10    1996-04-28      961 days    1998-12-15
36  1990-05-15    1994-02-14     1371 days    1997-11-16
39  1990-03-26    1993-01-25     1036 days    1995-11-27
41  1992-02-06    1996-05-10     1555 days    2000-08-12
50  1991-05-03    1999-07-17     2997 days    2007-09-30
52  1994-09-02    1997-05-14      985 days    2000-01-24
53  1995-11-29    1998-06-23      937 days    2001-01-15
54  1996-08-07    1998-04-04      605 days    1999-11-30
60  1993-02-14    1995-08-06      903 days    1998-01-25
63  1990-12-22    1995-09-02     1715 days    2000-05-13
64  1990-11-25    1998-05-14     2727 days    2005-10-31
66  1992-09-08    1998-12-29     2303 days    2005-04-19
67  1990-05-04    1993-02-04     1007 days    1995-11-08
70  1994-02-16    1999-11-06     2089 days    2005-07-26
71  1990-11-25    1998-04-06     2689 days    2005-08-16
73  1991-10-01    1993-05-19      596 days    1995-01-05
75  1990-06-25    1996-12-18     2368 days    2003-06-13
..         ...           ...           ...           ...
907 1994-08-11    1998-09-28     1509 days    2002-11-15
908 1993-11-04    1997-02-26     1210 days    2000-06-20
909 1991-01-19    1998-08-22     2772 days    2006-03-25
916 1994-12-03    1997-03-26      844 days    1999-07-18
918 1994-12-29    1996-07-29      578 days    1998-02-27
919 1992-01-25    1993-06-01      493 days    1994-10-07
922 1996-07-06    1998-12-05      882 days    2001-05-05
924 1991-03-17    1996-05-13     1884 days    2001-07-10
926 1990-10-31    1994-04-12     1259 days    1997-09-22
935 1990-09-26    1998-03-07     2719 days    2005-08-16
938 1993-03-24    1995-07-15      843 days    1997-11-04
942 1992-04-14    1997-03-03     1784 days    2002-01-20
943 1991-01-30    1999-12-02     3228 days    2008-10-03
945 1992-10-27    1994-11-03      737 days    1996-11-09
946 1991-07-02    1996-02-23     1697 days    2000-10-16
947 1991-06-18    1999-06-11     2915 days    2007-06-04
951 1991-10-02    1994-04-18      929 days    1996-11-02
953 1991-09-26    1994-05-08      955 days    1996-12-18
956 1995-08-23    1999-01-10     1236 days    2002-05-30
957 1994-10-01    1999-07-25     1758 days    2004-05-17
958 1990-04-26    1997-06-29     2621 days    2004-09-01
972 1990-02-07    1995-11-05     2097 days    2001-08-02
981 1997-01-31    1998-03-04      397 days    1999-04-05
983 1994-12-30    1997-07-29      942 days    2000-02-26
984 1991-07-25    1999-02-09     2756 days    2006-08-27
986 1990-12-10    1992-12-16      737 days    1994-12-23
990 1991-06-24    1996-02-02     1684 days    2000-09-12
991 1991-09-09    1998-03-30     2394 days    2004-10-18
993 1990-11-16    1998-04-27     2719 days    2005-10-06
997 1990-01-04    1991-10-03      637 days    1993-07-01

[394 rows x 4 columns]

In [32]:
mask = shipping["Delivery Time"] == "3423 days"
shipping[mask]

    order_date delivery_date Delivery Time Twice As Long
ID
130 1990-04-02    1999-08-16     3423 days    2008-12-29

In [33]:
shipping["Delivery Time"].max()

Timedelta('3583 days 00:00:00')